In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
# Let's create a dframe to work with (Highest elevation cities in USA)
dframe = DataFrame({'city':['Alma','Brian Head','Fox Park'],
                    'altitude':[3158,3000,2762]})

#Show
dframe

         city  altitude
0        Alma      3158
1  Brian Head      3000
2    Fox Park      2762

In [3]:
#Now let's say we wanted to add a column for the States, we can do that with a mapping.
state_map={'Alma':'Colorado','Brian Head':'Utah','Fox Park':'Wyoming'}

In [4]:
# Now we can map that data to our current dframe
dframe['state'] = dframe['city'].map(state_map)

In [5]:
#Show result
dframe

         city  altitude     state
0        Alma      3158  Colorado
1  Brian Head      3000      Utah
2    Fox Park      2762   Wyoming

In [10]:
dframe= DataFrame(np.arange(12).reshape((3, 4)),
                 index=['NY', 'LA', 'SF'],
                 columns=['A', 'B', 'C', 'D'])

#Show
dframe

    A  B   C   D
NY  0  1   2   3
LA  4  5   6   7
SF  8  9  10  11

In [11]:
dframe.index.map(str.lower)

Index(['ny', 'la', 'sf'], dtype='object')

In [12]:
dframe.index = dframe.index.map(str.lower)
#Show
dframe

    A  B   C   D
ny  0  1   2   3
la  4  5   6   7
sf  8  9  10  11

In [13]:
dframe.rename(index=str.title, columns=str.lower)

    a  b   c   d
Ny  0  1   2   3
La  4  5   6   7
Sf  8  9  10  11

In [14]:
dframe.rename(index={'ny': 'NEW YORK'},
            columns={'A': 'ALPHA'})

          ALPHA  B   C   D
NEW YORK      0  1   2   3
la            4  5   6   7
sf            8  9  10  11

In [15]:
dframe.rename(index={'ny': 'NEW YORK'}, inplace=True)
dframe

          A  B   C   D
NEW YORK  0  1   2   3
la        4  5   6   7
sf        8  9  10  11